In [1]:
import pandas as pd

In [2]:
# 1. Problem: Load an Excel file using Pandas and extract the data from a
# specific worksheet and specific columns.

In [3]:
df = pd.read_excel('Group trip planner1.xlsx')

In [4]:
df

,Trip planner,Unnamed: 1,10/28/2021 - 11/6/2021,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,List of travelers,NaN,NaN,NaN,NaN,NaN,NaN
2,Travel name,NaN,Phone,NaN,Email,NaN,NaN
3,Quinn Campbell,NaN,206-555-0199,NaN,quinncampbell@contoso.com,NaN,NaN
4,Casey Jensen,NaN,206-555-0199,NaN,caseyjensen@contoso.com,NaN,NaN
5,Chanok Rattanakoson,NaN,206-555-0199,NaN,chanokrattanakoson@contoso.com,NaN,NaN
6,Si-hyeon Choi,NaN,206-555-0199,NaN,sihyeonchoi@contoso.com,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,Trip itinerary,NaN,NaN,NaN,NaN,NaN,NaN
9,Date,Destination,#Days,# Nights,Lodging,Reservation,Notes
10,2021-10-28 00:00:00,San Juan Islands,4,3,General Clark's Inn,AZ1234,NaN
11,2021-11-01 00:00:00,Olympic national park,5,4,The Rosehip Hotel,AZ1234,NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Trip planner             10 non-null     object
 1   Unnamed: 1               3 non-null      object
 2   10/28/2021 - 11/6/2021   8 non-null      object
 3   Unnamed: 3               3 non-null      object
 4   Unnamed: 4               8 non-null      object
 5   Unnamed: 5               3 non-null      object
 6   Unnamed: 6               1 non-null      object
dtypes: object(7)
memory usage: 804.0+ bytes

In [6]:
# 2. Problem: Write a Python script using Openpyxl to create a new Excel
# workbook and write data to it from a Pandas dataframe.

In [38]:
from openpyxl import load_workbook

In [39]:
workbook = load_workbook('Group trip planner1.xlsx', data_only=True)

In [40]:
workbook.sheetnames

['Overview', 'Transportation', 'Packing', 'Emergency contacts']

In [41]:
worksheet = workbook['Overview']

In [42]:
df_list_of_travelers = pd.DataFrame()

In [43]:
travel_names = []
phones = []
emails = []

for i in range(5, 9):
    travel_names.append((worksheet.cell(row=i, column=1)).value)
    phones.append((worksheet.cell(row=i, column=3)).value)
    emails.append((worksheet.cell(row=i, column=5)).value)

df_list_of_travelers['Travel_Name'] = travel_names
df_list_of_travelers['Phone'] = phones
df_list_of_travelers['Email'] = emails

In [44]:
df_list_of_travelers

           Travel_Name         Phone                           Email
0       Quinn Campbell  206-555-0199       quinncampbell@contoso.com
1         Casey Jensen  206-555-0199         caseyjensen@contoso.com
2  Chanok Rattanakoson  206-555-0199  chanokrattanakoson@contoso.com
3        Si-hyeon Choi  206-555-0199         sihyeonchoi@contoso.com

In [45]:
df_list_of_travelers.set_index('Travel_Name')

                            Phone                           Email
Travel_Name
Quinn Campbell       206-555-0199       quinncampbell@contoso.com
Casey Jensen         206-555-0199         caseyjensen@contoso.com
Chanok Rattanakoson  206-555-0199  chanokrattanakoson@contoso.com
Si-hyeon Choi        206-555-0199         sihyeonchoi@contoso.com

In [47]:
import openpyxl
from openpyxl.utils.dataframe import dataframe_to_rows

In [48]:
workbook_new = openpyxl.Workbook()

In [49]:
worksheet_new = workbook_new.active

In [50]:
for r in dataframe_to_rows(df_list_of_travelers, index=False, header=True):
    worksheet_new.append(r)

In [51]:
workbook_new.save('Travelers.xlsx')

In [52]:
# 3. Problem: Use Pandas to read an Excel file that has multiple
# worksheets and combine the data from these sheets into a single dataframe.

In [53]:
excel_file = pd.ExcelFile('Group trip planner1.xlsx')

In [54]:
combined_data = pd.DataFrame()

In [55]:
for sheet_name in excel_file.sheet_names:
    df = excel_file.parse(sheet_name)
    combined_data = pd.concat([combined_data, df])

In [56]:
combined_data = combined_data.reset_index(drop=True)

In [57]:
combined_data.to_excel('GroupTripCOMBINED.xlsx', index=False)

In [58]:
# 4. Problem: Use Openpyxl to insert a new row or column into an existing Excel workbook.

In [59]:
workbook_change = openpyxl.load_workbook('Travelers.xlsx')

In [61]:
worksheet_change = workbook_change['Sheet']

In [62]:
worksheet_change.insert_rows(2) # insert row at row 2

In [63]:
worksheet_change.insert_cols(1) # insert col at column 2

In [64]:
worksheet_change.cell(row=2, column=1, value='New cell inserted')

In [65]:
workbook_change.save('Travelers_changed.xlsx')

In [66]:
# 5. Problem: Use Pandas to filter and sort data in an Excel spreadsheet
# based on specific criteria and output the results to a new Excel file.

In [77]:
data = pd.read_excel('Travelers.xlsx')
data

           Travel_Name         Phone                           Email
0       Quinn Campbell  206-555-0199       quinncampbell@contoso.com
1         Casey Jensen  206-555-0199         caseyjensen@contoso.com
2  Chanok Rattanakoson  206-555-0199  chanokrattanakoson@contoso.com
3        Si-hyeon Choi  206-555-0199         sihyeonchoi@contoso.com

In [78]:
filtered_data = data[data['Travel_Name'] == 'Quinn Campbell']

In [79]:
filtered_data

      Travel_Name         Phone                      Email
0  Quinn Campbell  206-555-0199  quinncampbell@contoso.com

In [80]:
sorted_data = data.sort_values('Travel_Name', ascending=False)

In [81]:
sorted_data

           Travel_Name         Phone                           Email
3        Si-hyeon Choi  206-555-0199         sihyeonchoi@contoso.com
0       Quinn Campbell  206-555-0199       quinncampbell@contoso.com
2  Chanok Rattanakoson  206-555-0199  chanokrattanakoson@contoso.com
1         Casey Jensen  206-555-0199         caseyjensen@contoso.com